const PHOTOS_COUNT = 25;
const MIN_LIKES = 15;
const MAX_LIKES = 200;
const MIN_COMMENTS = 0;
const MAX_COMMENTS = 30;
const MIN_AVATAR_ID = 1;
const MAX_AVATAR_ID = 6;

const DESCRIPTIONS = [
  'Красивый закат над морем',
  'Прогулка по вечернему городу',
  'Мой любимый кот',
  'Отличный день на природе',
  'Незабываемое путешествие',
];

const NAMES = [
  'Александр',
  'Евгения',
  'Руслан',
  'Татьяна',
  'Максим',
  'Светлана',
  'Артём',
  'Мария',
  'Иван',
  'Анна',
  'Дмитрий',
  'Екатерина',
];

const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают.',
];

export {
  PHOTOS_COUNT,
  MIN_LIKES,
  MAX_LIKES,
  MIN_COMMENTS,
  MAX_COMMENTS,
  MIN_AVATAR_ID,
  MAX_AVATAR_ID,
  DESCRIPTIONS,
  NAMES,
  MESSAGES
};
